In [4]:
import pandas as pd

In [17]:
data = { 'A':[4,-1,2], 'B':[3,4,5], 'C':[6,7,8]}
data

{'A': [4, -1, 2], 'B': [3, 4, 5], 'C': [6, 7, 8]}

In [6]:
df_1 = pd.DataFrame(data=data)
df_1

   A  B  C
0  0  3  6
1  1  4  7
2  2  5  8

In [7]:
indexes = ['fila_0', 'fila_1', 'fila_2']

In [8]:
df_2 = pd.DataFrame(data, indexes)
df_2

        A  B  C
fila_0  0  3  6
fila_1  1  4  7
fila_2  2  5  8

In [9]:
dates = pd.date_range(start="01/02/2024", end="01/04/2024")
dates

DatetimeIndex(['2024-01-02', '2024-01-03', '2024-01-04'], dtype='datetime64[ns]', freq='D')

In [18]:
df_3 = pd.DataFrame(data , dates)
df_3

            A  B  C
2024-01-02  4  3  6
2024-01-03 -1  4  7
2024-01-04  2  5  8

In [12]:
df_3.dtypes

A    int64
B    int64
C    int64
dtype: object

In [13]:
df_3.head(1)

            A  B  C
2024-01-02  0  3  6

In [14]:
df_3.index

DatetimeIndex(['2024-01-02', '2024-01-03', '2024-01-04'], dtype='datetime64[ns]', freq='D')

In [15]:
df_3.columns

Index(['A', 'B', 'C'], dtype='object')

In [16]:
df_3.T

   2024-01-02  2024-01-03  2024-01-04
A           0           1           2
B           3           4           5
C           6           7           8

In [20]:
df_3.sort_values(by='A', ascending=False)

            A  B  C
2024-01-02  4  3  6
2024-01-04  2  5  8
2024-01-03 -1  4  7

In [21]:
df_3['A']

2024-01-02    4
2024-01-03   -1
2024-01-04    2
Freq: D, Name: A, dtype: int64

In [22]:
df_3['E'] = ['one', 'two', 'three']
df_3

            A  B  C      E
2024-01-02  4  3  6    one
2024-01-03 -1  4  7    two
2024-01-04  2  5  8  three

In [23]:
df_3[df_3['E'].isin(['two', 'three'])]

            A  B  C      E
2024-01-03 -1  4  7    two
2024-01-04  2  5  8  three

In [25]:
df_3.iloc[0,0] = 4
df_3

            A  B  C      E
2024-01-02  4  3  6    one
2024-01-03 -1  4  7    two
2024-01-04  2  5  8  three